app/views/statique/accueil.html.erb

SELECT "gossips".* FROM "gossips"
---

<%Gossip.all.each do |gossip|%>