app/views/statique/index.html.erb

		</p>
	<%Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"