app/controllers/gossips_controller.rb

  def update
  	@gossip = Gossip.find(params[:id])
  	gossip_params = params.require(:gossip).permit(:author, :content)
  	@gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Sed nesct et."], ["updated_at", "2018-10-31 12:35:31.926478"], ["id", 1]]

  def create
  	gossip = Gossip.create(post_params)
---
INSERT INTO "gossips" ("author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "Moi"], ["content", "OK"], ["created_at", "2018-10-31 12:34:30.736155"], ["updated_at", "2018-10-31 12:34:30.736155"]]